f1 = 0.1
f2 = 0.2
f3 = f1 + f2
print(f3)
#结果为0.30000000000000004，出现精度丢失

from decimal import Decimal

f4 = Decimal('0.1')
f5 = Decimal('0.2')
f6 = f5 + f4
print(f6,type(f6))
#解决精度丢失，f6类型为decimal.Decimal，进行了封装

print("----------------------------------------------------")

num1 = 1
num2 = True
print(num2 == 1)
print(num2 is num1)
print(num2 is 1)
#虽然True数值为1，但是和1依然是不同的对象。避免使用 is 来比较数字、字符串等字面量的值，即使它在某些情况下“碰巧”能工作

str1 = "helloworld"
str2 = "helloworld"
print(str1 is str2)

#==	比较值是否相等	比较数据内容
#is	比较对象身份（内存地址）检查是否是同一对象

print("----------------------------------------------------")

#如果接收用户在键盘上输入一些字符，Python提供了一个input()函数
#可以让用户输入字符串，并存放到一个字符串变量里。

print("----------------------------------------------------")

a = 10
b = 2
c = a / b  #注意：结果为浮点类型
print(a , "/" , b , "的结果为" , c)
# //整除，除后向下取整

print("----------------------------------------------------")

# 海象运算符
num1 = 10
print(num2 := 30 > num1 )
print(num2)

print((num2 := 30) > num1 )
print(num2)
#注意海象运算符也是赋值运算符，都是等等号后面的表达式算完再赋值

print("----------------------------------------------------")
num3 = 'abc'
# 注意：不同的数据类型之间不能进行大小的比较
# print(num1 > num3) ×
# 如果是字符串比较大小，是从最左边开始逐个比较字符串中相应位置的字符的ASCII码
print('5' > '6') # False
print('15' > '6') # False
